//#include<iostream>
//#include<iterator>
//#include<numeric>
//#include<Windows.h>
//#include<vector>
//using namespace std;
//void introduction(void)
//
//{
//
//	printf("---------------------------------------------------------------------------\n");
//
//	Sleep(1000);
//
//	printf("------------------------------술이--------------------------------------\n");
//
//	Sleep(1000);
//
//	printf("----------------------------문제야~---------------------------------\n");
//
//	Sleep(1000);
//
//	system("cls");
//
//	printf("-----------------------------문제~~~---------------------------------------\n");
//
//	Sleep(1000);
//
//	system("cls");
//
//	printf("-------------------------------왜 자꾸 널 떠올리게 해~~~---------------------------------------\n");
//
//	Sleep(1000);
//
//	printf("--------------------------------아냐----------------------------------------\n");
//
//	Sleep(1000);
//
//	system("cls");
//
//	printf("---------------------------------내가-----------------------------------------\n");
//
//	Sleep(1000);
//
//	printf("---------------------------------문제야-----------------------------------------\n");
//
//	Sleep(1000);
//
//	printf("---------------------------------문제~-----------------------------------------\n");
//
//	Sleep(1000);
//
//	printf("---------------------------------아직까지-----------------------------------------\n");
//
//	Sleep(1000);
//
//	printf("---------------------------------너만 사랑해~-----------------------------------------\n");
//
//	Sleep(1000);
//
//	system("cls");
//
//	printf("\n\n\n\n\n\n\n\n");
//
//	printf("    ○○○ \n");
//
//	printf("   ○○○○ \n");
//
//	printf("  ○○○○○ \n");
//
//	printf("   ○○○○ \n");
//
//	printf("    ○○○○○○○☆  \n");
//
//	Sleep(100);
//
//	system("cls");
//
//
//
//	printf("\n\n\n\n\n\n\n\n");
//
//	printf("    ○○○ \n");
//
//	printf("   ○●○● \n");
//
//	printf("  ○●○●○ \n");
//
//	printf("   ○○●○ \n");
//
//	printf("    ○○○○○○○☆  \n");
//
//	Sleep(100);
//
//	system("cls");
//
//
//
//	printf("\n\n\n\n\n\n\n\n");
//
//	printf("    ○○○ \n");
//
//	printf("   ○○●○ \n");
//
//	printf("  ○●○●○ \n");
//
//	printf("   ○○○● \n");
//
//	printf("    ○○○●○○○☆  \n");
//
//	Sleep(100);
//
//	system("cls");
//
//
//
//	printf("\n\n\n\n\n\n\n\n");
//
//	printf("    ○○○ \n");
//
//	printf("   ○●○● \n");
//
//	printf("  ○○○●○ \n");
//
//	printf("   ●○●○ \n");
//
//	printf("    ○○○○○○○☆  \n");
//
//	Sleep(100);
//
//	system("cls");
//
//
//
//	printf("\n\n\n\n\n\n\n\n");
//
//	printf("    ○○○ \n");
//
//	printf("   ○●○● \n");
//
//	printf("  ○●○●○ \n");
//
//	printf("   ○○●○ \n");
//
//	printf("    ○○○○○○○☆  \n");
//
//	Sleep(100);
//
//	system("cls");
//
//
//
//	printf("\n\n\n\n\n\n\n\n");
//
//	printf("    ○○○ \n");
//
//	printf("   ○○●○ \n");
//
//	printf("  ○●○●○ \n");
//
//	printf("   ○○○● \n");
//
//	printf("    ○○○●○○○☆  \n");
//
//	Sleep(100);
//
//	system("cls");
//
//
//
//	printf("\n\n\n\n\n\n\n\n");
//
//	printf("    ○○○ \n");
//
//	printf("   ○○●○ \n");
//
//	printf("  ○●○●○ \n");
//
//	printf("   ○○●○ \n");
//
//	printf("    ○○○○●○○☆  \n");
//
//	Sleep(100);
//
//	system("cls");
//
//
//
//	printf("\n\n\n\n\n\n\n\n");
//
//	printf("    ○○○ \n");
//
//	printf("   ○○●○ \n");
//
//	printf("  ○○○●○ \n");
//
//	printf("   ○○●○ \n");
//
//	printf("    ○○○●●○●☆  \n");
//
//	Sleep(100);
//
//	system("cls");
//
//
//
//	printf("\n\n\n\n\n\n\n\n");
//
//	printf("    ○○○ \n");
//
//	printf("   ○○○○ \n");
//
//	printf("  ○○○○○ \n");
//
//	printf("   ○○●● \n");
//
//	printf("    ○●○○●●●☆  \n");
//
//	Sleep(100);
//
//	system("cls");
//
//
//
//	printf("\n\n\n\n\n\n\n\n");
//
//	printf("    ○○○ \n");
//
//	printf("   ○○○○ \n");
//
//	printf("  ○○○○○ \n");
//
//	printf("   ○○●● \n");
//
//	printf("    ○○●○●●●☆  \n");
//
//	Sleep(100);
//
//	system("cls");
//
//
//
//	printf("\n\n\n\n\n\n\n\n");
//
//	printf("    ○○○ \n");
//
//	printf("   ○○○○ \n");
//
//	printf("  ○○○○○ \n");
//
//	printf("   ○○○● \n");
//
//	printf("    ○○●●●●●☆  \n");
//
//	Sleep(100);
//
//	system("cls");
//
//
//
//	printf("\n\n\n\n\n\n\n\n");
//
//	printf("    ○○○ \n");
//
//	printf("   ○○○○ \n");
//
//	printf("  ○○○○○ \n");
//
//	printf("   ○○○○ \n");
//
//	printf("    ○○●●●●●★  \n");
//
//	Sleep(1000);
//
//	system("cls");
//
//	printf("--------------------------자고 싶다 ㅅㅂ....----------------------------\n");
//
//	Sleep(3000);
//
//	system("cls");
//
//}
//int main(void)
//{
//	introduction();
//}